src/eilmer/notes/design-proposal-for-bcs.org
#+Author: Rowan J. Gollan
#+Date: 11-Mar-2015
#+Title: Design Proposals for Boundary Condition Implementation in Eilmer4

* Eilmer3 implementation --- background for discussion
In Eilmer3, the implementation of boundary conditions accounts
for a little over 6% of the total lines of code written in C++.
In the Python code, the percentage of lines of code just dedicated
to the boundary conditions is about 10%.[fn:1]
However, these relatively small numbers belie the amount
of effort that is spent on the boundary condition portion
of the code.
By effort, I'm talking about discussion, planning,
re-implementation, refactoring and other code development
activities that have focused on the boundary conditions.
As we move forward with Eilmer4 development, it's clear
that we've outgrown the approach we used for boundary
conditions with Eilmer3.
For Eilmer4, we would like to implement an improved design.
It's useful, therefore, to dissect the implementation in
Eilmer3 and see where and how there might be room for improvement.


[fn:1] The portion of code dedicated to boundary conditions
was assumed to be that found in files that matched ~bc_*.cxx~
and ~exch_*~. It might seem odd to include the files related
to data exchange but they are just a boundary condition that's
given some special status. The percentage can be computed
with the following set of command line instructions issued
in the Eilmer3 source area:
   : echo "$(wc -l bc*.cxx exch*.cxx | grep total)" "$(wc -l *.cxx | grep total)" | awk '{print $1/$3*100}'
For the Python code, the code in ~bc_defs.py~ was taken as representative
of the lines of code dedicated to boundary condition implementation.
The Python code exclusively deals with user configuration and not numerical implementation per se. 
   : echo "$(wc -l bc_defs.py)" "$(wc -l *.py | grep total)" "$(wc -l libprep3.py)" | awk '{print $1*100/($3 - $5)}'
Note that the SWIG-generated ~libprep3.py~ file is removed from the accounting.

In our approach to numerically solving the Navier-Stokes
equations, we separate the update of flow physics into
an update for convective processes and an update for
diffusive processes.
Thus, in terms of boundary conditions, we need to apply
the special handling at the boundary at least twice:
once for the convective update, and once for the diffusive update.
Also, what the boundary condition needs to do for the convective update
and then later for the diffusive update is not likely to be
the same for both updates.
This distinction between convective and diffusive updates
is reflected in the code implementation.
In Eilmer3, boundary conditions are implemented as
classes.
The base class is the aptly named ~BoundaryCondition~.
The two workhorse public methods it provides are
~apply_convective()~ and ~apply_viscous()~.
These are called at the appropriate points in the code
before undertaking the convective or diffusive update.

** Strength of the present design
The present design provides a very neat entry point
into the code.
When one wants to inspect what an *Adiabatic* boundary condition
does, that is, how it is implemented, then one can
open the ~bc_adiabatic.cxx~ and the code is in one place.
It would probably be necessary to see where
~apply_convective()~ and ~apply_viscous()~ are called also
to get full context.
But basically, that's it for understanding the implementation.

** Weaknesses of the present design
From a modularity standpoint, there are hints in this design
that a given boundary condition object does too much.
That hint is the fact that it applies two different behaviours
in different contexts.
What this leads to is code repetition.
Say you have a list of possible behaviours labelled
/A/, /B/, /C/, and /D/ that could apply to the convective portion of the
update.
At the same time, you have behaviours /w/, /x/, /y/, and /z/ that
apply to the diffusive part of the update.
The problem is that our single ~BoundaryCondition~ class needs to
provide the implementation for the combined behaviour of
say /A-w/, /A-x/, /B-w/, /B-y/, /B-z/ and so on.
Not all combinations are valid, that is, physically reasonable
for our flow solver but you can see how the combinations
quickly multiply.
A design technique fix for this is composition.
We could decompose the ~BoundaryCondition~ object into
a convective flux component, and a diffusive flux component.
We'll explore this idea, or an extension of it, in the design
proposals to follow.

The other hint that the present ~BoundaryCondition~ object does too
much is the fact that certain classes rely on the base class
implementation.
This implies that a particular class doesn't really care
about interacting with the convective terms, or, vice versa,
doesn't really care about interacting with the diffusive terms.
(This reliance on base class implementation also
detracts from the single-point-of-entry strength mentioned above.
For these boundary conditions, the implementation is no longer in one
place, and one has to go looking elsewhere.)

Finally, although the ~BoundaryCondition~ object does too much,
the total implementation of boundary effects actually doesn't
do enough, or rather, there is a lack of flexibility.
We have come across a number of boundary condition behaviours
that don't fall neatly into the pattern of "apply this just now before the
convective update" and then "apply this just now before the diffusive
update".
For these cases, the code has extra switches and flags that intercept
the general behaviour based on special conditions.
These "special conditions" are related to boundary effects and
so should be treated somewhere else.

** Why it's like this
Rather than finish this section beating up on poor old Eilmer3,
I'd like to mention why we've outgrown this boundary condition
implementation.
The primary reason is that Eilmer's multiphysics capability
has grown.
The boundary condition implementation is a very serviceable
arrangement if you restrict yourself to a pure fluid.
However, the extension to multi-component fluids, coupled
heat transfer at the boundaries, MHD effects,
surfaces that ablate and pyrolise, moving boundaries and radiating
flow fields has put a large amount of strain on our boundary
condition implementation.
Mentioning this here also helps inform the discussion of
what we need to support in Eilmer4.

