src/eilmer/notes/design-proposal-for-bcs.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Design Proposals for Boundary Condition Implementation in Eilmer4</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Design Proposals for Boundary Condition Implementation in Eilmer4"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="11-Mar-2015"/>
<meta name="author" content="Rowan J. Gollan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Design Proposals for Boundary Condition Implementation in Eilmer4</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Eilmer3 implementation &mdash; background for discussion</a>
<ul>
<li><a href="#sec-1-1">1.1 Strength of the present design</a></li>
<li><a href="#sec-1-2">1.2 Weaknesses of the present design</a></li>
<li><a href="#sec-1-3">1.3 Why it's like this</a></li>
</ul>
</li>
<li><a href="#sec-2">2 A proposal for boundary condition implementation in Eilmer4</a>
<ul>
<li><a href="#sec-2-1">2.1 Specialisation on <i>when</i> the boundary condition action takes place</a></li>
<li><a href="#sec-2-2">2.2 Specialisation on <i>what</i> items a boundary condition affects</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Discussion of the design proposal: pros and cons</a>
<ul>
<li><a href="#sec-3-1">3.1 Pro: extensibility</a></li>
<li><a href="#sec-3-2">3.2 Pro: flexible</a></li>
<li><a href="#sec-3-3">3.3 Con: overly complex, difficult to debug</a></li>
<li><a href="#sec-3-4">3.4 Con: series of actions might be put in wrong order or clobber each other</a></li>
<li><a href="#sec-3-5">3.5 Con: Users will be thoroughly confused.</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Closing thoughts</a>
<ul>
<li><a href="#sec-4-1">4.1 Simplification</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Eilmer3 implementation &mdash; background for discussion</h2>
<div class="outline-text-2" id="text-1">

<p>In Eilmer3, the implementation of boundary conditions accounts
for a little over 6% of the total lines of code written in C++.
In the Python code, the percentage of lines of code just dedicated
to the boundary conditions is about 10%.<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>
However, these relatively small numbers belie the amount
of effort that is spent on the boundary condition portion
of the code.
By effort, I'm talking about discussion, planning,
re-implementation, refactoring and other code development
activities that have focused on the boundary conditions.
As we move forward with Eilmer4 development, it's clear
that we've outgrown the approach we used for boundary
conditions with Eilmer3.
For Eilmer4, we would like to implement an improved design.
It's useful, therefore, to dissect the implementation in
Eilmer3 and see where and how there might be room for improvement.
</p>
<p>
In our approach to numerically solving the Navier-Stokes
equations, we separate the update of flow physics into
an update for convective processes and an update for
diffusive processes.
Thus, in terms of boundary conditions, we need to apply
the special handling at the boundary at least twice:
once for the convective update, and once for the diffusive update.
Also, what the boundary condition needs to do for the convective update
and then later for the diffusive update is not likely to be
the same for both updates.
This distinction between convective and diffusive updates
is reflected in the code implementation.
In Eilmer3, boundary conditions are implemented as
classes.
The base class is the aptly named <code>BoundaryCondition</code>.
The two workhorse public methods it provides are
<code>apply_convective()</code> and <code>apply_viscous()</code>.
These are called at the appropriate points in the code
before undertaking the convective or diffusive update.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Strength of the present design</h3>
<div class="outline-text-3" id="text-1-1">

<p>The present design provides a very neat entry point
into the code.
When one wants to inspect what an <b>Adiabatic</b> boundary condition
does, that is, how it is implemented, then one can
open the <code>bc_adiabatic.cxx</code> and the code is in one place.
It would probably be necessary to see where
<code>apply_convective()</code> and <code>apply_viscous()</code> are called also
to get full context.
But basically, that's it for understanding the implementation.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Weaknesses of the present design</h3>
<div class="outline-text-3" id="text-1-2">

<p>From a modularity standpoint, there are hints in this design
that a given boundary condition object does too much.
That hint is the fact that it applies two different behaviours
in different contexts.
What this leads to is code repetition.
Say you have a list of possible behaviours labelled
<i>A</i>, <i>B</i>, <i>C</i>, and <i>D</i> that could apply to the convective portion of the
update.
At the same time, you have behaviours <i>w</i>, <i>x</i>, <i>y</i>, and <i>z</i> that
apply to the diffusive part of the update.
The problem is that our single <code>BoundaryCondition</code> class needs to
provide the implementation for the combined behaviour of
say <i>A-w</i>, <i>A-x</i>, <i>B-w</i>, <i>B-y</i>, <i>B-z</i> and so on.
Not all combinations are valid, that is, physically reasonable
for our flow solver but you can see how the combinations
quickly multiply.
A design technique fix for this is composition.
We could decompose the <code>BoundaryCondition</code> object into
a convective flux component, and a diffusive flux component.
We'll explore this idea, or an extension of it, in the design
proposals to follow.
</p>
<p>
The other hint that the present <code>BoundaryCondition</code> object does too
much is the fact that certain classes rely on the base class
implementation.
This implies that a particular class doesn't really care
about interacting with the convective terms, or, vice versa,
doesn't really care about interacting with the diffusive terms.
(This reliance on base class implementation also
detracts from the single-point-of-entry strength mentioned above.
For these boundary conditions, the implementation is no longer in one
place, and one has to go looking elsewhere.)
</p>
<p>
Finally, although the <code>BoundaryCondition</code> object does too much,
the total implementation of boundary effects actually doesn't
do enough, or rather, there is a lack of flexibility.
We have come across a number of boundary condition behaviours
that don't fall neatly into the pattern of "apply this just now before the
convective update" and then "apply this just now before the diffusive
update".
For these cases, the code has extra switches and flags that intercept
the general behaviour based on special conditions.
These "special conditions" are related to boundary effects and
so should be treated somewhere else.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Why it's like this</h3>
<div class="outline-text-3" id="text-1-3">

<p>Rather than finish this section beating up on poor old Eilmer3,
I'd like to mention why we've outgrown this boundary condition
implementation.
The primary reason is that Eilmer's multiphysics capability
has grown.
The boundary condition implementation is a very serviceable
arrangement if you restrict yourself to a pure fluid.
However, the extension to multi-component fluids, coupled
heat transfer at the boundaries, MHD effects,
surfaces that ablate and pyrolise, moving boundaries and radiating
flow fields has put a large amount of strain on our boundary
condition implementation.
Mentioning this here also helps inform the discussion of
what we need to support in Eilmer4.
</p>
</div>
</div>

</div>
