src/eilmer/notes/design-proposal-for-bcs.org
* A proposal for boundary condition implementation in Eilmer4 
I'm going to begin by just stating the proposed implementation.
Then I'll give some arguments for and against its use.
Also, bear in mind, this first part of the design proposal concerns
the developer of the internal numerics in D.
As you read this, there might be a few WTF moments when you
think about this design as a user.
I will discuss later how the user never need know about the
internal design.

Let's summarise the limitations in the Eilmer3 design that
were getting difficult to work around:
1. the boundary conditions were only applied at two
   points in time in the code: first, in the
   convective update before reconstruction,
   and second, in the diffusive update just
   before computing spatial derivatives; and 
2. when they were applied, they had to exert their
   effect on /all/ governing equations.
Regarding point 1, this lead to a number of special cases
in the code to get certain boundary condition effects.
That number of "special" cases was growing to the
point that they weren't so special anymore.
Regarding point 2, this is what potentially leads
to requiring a combinatorial amount of boundary conditions.
We want to avoid this.

These limitations point directly to a design solution.
We need to be able to specialise the boundary condition
code is two distinct ways:
1. We need specialisation based on /when/ in the code
   the boundary conditions are called.
2. We need specialisation of action based on /what/
   flow properties are affected, or more specifically, which governing
   equations the boundary condition interacts with.

I'll now present the proposed design for boundary conditions
as a top-down design.
Let's consider the major steps the code does in a time step:
1. Convective update
   + a. Reconstruction
   + b. Convective flux calculation
   + c. Time derivative estimate
   + d. Cell properties update
2. Diffusive update
   + a. Spatial derivative calculation
   + b. Diffusive flux assembly
   + c. Time derivative estimate
   + d. Cell properties update
In my current thinking, we want four points of special
boundary condition action.
Those actions are:
1. Before reconstruction (1a.), *set ghost cell properties.*
2. After convective flux calculation (1b.), *intercept and possibly override certain boundary fluxes.*
3. Before spatial derivative calculation (2a.), *set boundary interface values.*
4. After diffusive dlux assembly (2b.), *intercept and possibly override certain boundary fluxes.*

Amongst those four actions, we have three different classes of boundary condition:
1. those that set ghost cells;
2. those that set fluxes; and
3. those that set interface values.
So the design proposal calls for three distinct boundary conditions classes:
1. ~GhostCellBC~,
2. ~FluxBC~, and
3. ~InterfaceBC~.
These are all separate types. I can't at the moment see any reason they
would need to share a common base type.

Returning a little higher to our view on the design, each ~Block~ needs
to keep four lists. In each of those lists is a set of appropriate
boundary conditions to be applied in order.
The proposed four lists are:
1. ~preReconActions = [...., ...., ...]~;
2. ~postConvFluxActions = [...., ...., ...., ...]~;
3. ~preSpatialDerivActions = [..., ..., ..., ...]~; and
4. ~postDiffFluxActions = [..., ..., ..., ...]~.
Why a list of actions and not just a single item?
Well this addresses our problem of combinatorial
explosion of repeated code.
I might have a boundary condition action that is only
interested in setting properties related to the
energy equation.
However, this is not enough information to specify the
complete boundary behaviour.
So in that case, I would also have to apply a boundary condition
object that gives information to satisfy the continuity
and momentum conservation equations also.

If one still wants a ~BoundaryCondition~ object, then it could be a
container for these items.
It would contain the four action lists, and each of those lists
has the sequence of boundary conditions to apply.
Note that a list can contain multiple actions (obviously, it's a list!)
but all the actions are the same /class/ of action.[fn:2]
So, for example, it only makes sense for the ~preReconActions~ to be
of type ~GhostCellBC~.
If you want to set the flux at the boundary with a ~FluxBC~, then put that action
in the ~postConvFluxActions~.
In a similar vein, the list of ~preSpatialDerivActions~ will all be of
type ~InterfaceBC~.

[fn:2] At least, that's my present thinking. I can't think of why you
would need to mix and match the type of action within a list of actions.

** Specialisation on /when/ the boundary condition action takes place
Perhaps it's not necessary to belabour this point.
I'll elaborate here in any case as this document might become useful
as part of a developer guide for the code.

Referring to the list of possible boundary condition actions,
we use action 1 (pre-reconstruction event)
when it's natural for us to specify a boundary condition as ghost cells.
In this case, we don't treat the boundary interfaces as special.
Our looping machinery runs all the way out to the edge interfaces doing reconstruction
and flux calculation. Thus, the effect at the boundary is obtained by the
appropriate setting of ghost cell properties.

We use action 2 (post convective flux calculation) 
when it's more natural to set convective fluxes at
a boundary edge.
In this case, we let Eilmer do a reconstruction and flux calculation
with dummy values.[fn:3]
After this, we intercept that dummy flux with our desired boundary flux.

Action 3 (pre spatial derivative calculation) can be used
to set certain flow properties at the interface.
These are then used when the code computes the spatial derivatives
and the diffusive fluxes that follow.

Finally, action 4 (post diffusive flux calculation) can be
used to override certain diffusive flux values after they have
been computed by the regular eilmer machinery for diffusive flux.

[fn:3] It's probably not worth the effort of
trying to specialise the looping routines when they do /not/
need to go all the way to the edge.
There is little efficiency gain (as we are only talking about edge interfaces)
and only added complexity.
An objection to this approach might be that the dummy values cause issues
for the reconstructor (or more likely the thermo calls in the reconstructor).
My suggestion would be to set the ghost cells with valid dummy values
for all time.
For example, take the initial condition for the nearest interior cell and
keep that state constant in the ghost cells.
The assumption is that the initial condition is valid in a thermodynamic sense.

** Specialisation on /what/ items a boundary condition affects
The motivation for splitting the boundary condition behaviour into
three types --- ghost cell, flux and interface --- is just to make
it very explicit about what behaviour a certain boundary condition 
applies.
I can't think of any easy way to guarantee that a FluxBC doesn't touch
a ghost cell value.[fn:4]
However, by putting them in distinct classes, we can at least
prevent the placement of a ~FluxBC~ where a GhostCellBC is expected.

[fn:4]
Well, we could only pass a list of interfaces to the ~FluxBC~ object.
However, I think that will be overly restrictive and prevent
access to some information that the ~FluxBC~ might reasonably need.


* Discussion of the design proposal: pros and cons
I am biased and do favour this design.
However, I'll try to list the pros and cons as they occur to me.

