src/eilmer/notes/design-proposal-for-bcs.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> A proposal for boundary condition implementation in Eilmer4</h2>
<div class="outline-text-2" id="text-2">

<p>I'm going to begin by just stating the proposed implementation.
Then I'll give some arguments for and against its use.
Also, bear in mind, this first part of the design proposal concerns
the developer of the internal numerics in D.
As you read this, there might be a few WTF moments when you
think about this design as a user.
I will discuss later how the user never need know about the
internal design.
</p>
<p>
Let's summarise the limitations in the Eilmer3 design that
were getting difficult to work around:
</p><ol>
<li>the boundary conditions were only applied at two
   points in time in the code: first, in the
   convective update before reconstruction,
   and second, in the diffusive update just
   before computing spatial derivatives; and 
</li>
<li>when they were applied, they had to exert their
   effect on <i>all</i> governing equations.
</li>
</ol>

<p>Regarding point 1, this lead to a number of special cases
in the code to get certain boundary condition effects.
That number of "special" cases was growing to the
point that they weren't so special anymore.
Regarding point 2, this is what potentially leads
to requiring a combinatorial amount of boundary conditions.
We want to avoid this.
</p>
<p>
These limitations point directly to a design solution.
We need to be able to specialise the boundary condition
code is two distinct ways:
</p><ol>
<li>We need specialisation based on <i>when</i> in the code
   the boundary conditions are called.
</li>
<li>We need specialisation of action based on <i>what</i>
   flow properties are affected, or more specifically, which governing
   equations the boundary condition interacts with.
</li>
</ol>


<p>
I'll now present the proposed design for boundary conditions
as a top-down design.
Let's consider the major steps the code does in a time step:
</p><ol>
<li>Convective update
<ul>
<li>a. Reconstruction
</li>
<li>b. Convective flux calculation
</li>
<li>c. Time derivative estimate
</li>
<li>d. Cell properties update
</li>
</ul>

</li>
<li>Diffusive update
<ul>
<li>a. Spatial derivative calculation
</li>
<li>b. Diffusive flux assembly
</li>
<li>c. Time derivative estimate
</li>
<li>d. Cell properties update
</li>
</ul>

</li>
</ol>

<p>In my current thinking, we want four points of special
boundary condition action.
Those actions are:
</p><ol>
<li>Before reconstruction (1a.), <b>set ghost cell properties.</b>
</li>
<li>After convective flux calculation (1b.), <b>intercept and possibly override certain boundary fluxes.</b>
</li>
<li>Before spatial derivative calculation (2a.), <b>set boundary interface values.</b>
</li>
<li>After diffusive dlux assembly (2b.), <b>intercept and possibly override certain boundary fluxes.</b>
</li>
</ol>


<p>
Amongst those four actions, we have three different classes of boundary condition:
</p><ol>
<li>those that set ghost cells;
</li>
<li>those that set fluxes; and
</li>
<li>those that set interface values.
</li>
</ol>

<p>So the design proposal calls for three distinct boundary conditions classes:
</p><ol>
<li><code>GhostCellBC</code>,
</li>
<li><code>FluxBC</code>, and
</li>
<li><code>InterfaceBC</code>.
</li>
</ol>

<p>These are all separate types. I can't at the moment see any reason they
would need to share a common base type.
</p>
<p>
Returning a little higher to our view on the design, each <code>Block</code> needs
to keep four lists. In each of those lists is a set of appropriate
boundary conditions to be applied in order.
The proposed four lists are:
</p><ol>
<li><code>preReconActions = [...., ...., ...]</code>;
</li>
<li><code>postConvFluxActions = [...., ...., ...., ...]</code>;
</li>
<li><code>preSpatialDerivActions = [..., ..., ..., ...]</code>; and
</li>
<li><code>postDiffFluxActions = [..., ..., ..., ...]</code>.
</li>
</ol>

<p>Why a list of actions and not just a single item?
Well this addresses our problem of combinatorial
explosion of repeated code.
I might have a boundary condition action that is only
interested in setting properties related to the
energy equation.
However, this is not enough information to specify the
complete boundary behaviour.
So in that case, I would also have to apply a boundary condition
object that gives information to satisfy the continuity
and momentum conservation equations also.
</p>
<p>
If one still wants a <code>BoundaryCondition</code> object, then it could be a
container for these items.
It would contain the four action lists, and each of those lists
has the sequence of boundary conditions to apply.
Note that a list can contain multiple actions (obviously, it's a list!)
but all the actions are the same <i>class</i> of action.<sup><a class="footref" name="fnr-.2" href="#fn-.2">2</a></sup>
So, for example, it only makes sense for the <code>preReconActions</code> to be
of type <code>GhostCellBC</code>.
If you want to set the flux at the boundary with a <code>FluxBC</code>, then put that action
in the <code>postConvFluxActions</code>.
In a similar vein, the list of <code>preSpatialDerivActions</code> will all be of
type <code>InterfaceBC</code>.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Specialisation on <i>when</i> the boundary condition action takes place</h3>
<div class="outline-text-3" id="text-2-1">

<p>Perhaps it's not necessary to belabour this point.
I'll elaborate here in any case as this document might become useful
as part of a developer guide for the code.
</p>
<p>
Referring to the list of possible boundary condition actions,
we use action 1 (pre-reconstruction event)
when it's natural for us to specify a boundary condition as ghost cells.
In this case, we don't treat the boundary interfaces as special.
Our looping machinery runs all the way out to the edge interfaces doing reconstruction
and flux calculation. Thus, the effect at the boundary is obtained by the
appropriate setting of ghost cell properties.
</p>
<p>
We use action 2 (post convective flux calculation) 
when it's more natural to set convective fluxes at
a boundary edge.
In this case, we let Eilmer do a reconstruction and flux calculation
with dummy values.<sup><a class="footref" name="fnr-.3" href="#fn-.3">3</a></sup>
After this, we intercept that dummy flux with our desired boundary flux.
</p>
<p>
Action 3 (pre spatial derivative calculation) can be used
to set certain flow properties at the interface.
These are then used when the code computes the spatial derivatives
and the diffusive fluxes that follow.
</p>
<p>
Finally, action 4 (post diffusive flux calculation) can be
used to override certain diffusive flux values after they have
been computed by the regular eilmer machinery for diffusive flux.
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Specialisation on <i>what</i> items a boundary condition affects</h3>
<div class="outline-text-3" id="text-2-2">

<p>The motivation for splitting the boundary condition behaviour into
three types &mdash; ghost cell, flux and interface &mdash; is just to make
it very explicit about what behaviour a certain boundary condition 
applies.
I can't think of any easy way to guarantee that a FluxBC doesn't touch
a ghost cell value.<sup><a class="footref" name="fnr-.4" href="#fn-.4">4</a></sup>
However, by putting them in distinct classes, we can at least
prevent the placement of a <code>FluxBC</code> where a GhostCellBC is expected.
</p>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Discussion of the design proposal: pros and cons</h2>
<div class="outline-text-2" id="text-3">

<p>I am biased and do favour this design.
However, I'll try to list the pros and cons as they occur to me.
</p>

</div>
